[{"_template":"html","content":"\n\t\t\t\t\t\t<h1>Discover The Beauty and Grandeur of The Florida Keys</h1><p style=\"margin-top: 24px; margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-family: Arial, sans-serif; font-size: 15px; font-stretch: inherit; line-height: 25px; vertical-align: baseline; overflow: visible;\">Welcome to The Marker Waterfront Resort. As you arrive at the heart of the Key West Historic Seaport, take a deep breath of calming ocean air and gaze at beautifully landscaped grounds. Ascend a dramatic staircase to our lobby, where towering glass windows offer unique glimpses at the lush tropical surroundings. Discover our spacious 400-square foot guest rooms swathed in luscious cream linens alongside soothing dark woods. Then slip into your oversized soaking tub or step out on to your private balcony with one of several stimulating views – from the marina to the gardens. Feel boundaries dissolve, and stress melt away.</p><p style=\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-family: Arial, sans-serif; font-size: 15px; font-stretch: inherit; line-height: 25px; vertical-align: baseline; overflow: visible;\">As you continue to explore your Marker experience, you’ll find inspiring and unexpected design flourishes that engage your imagination and root you in a sense of wonder and escape. A curated collection of art, books, and thoughtful local amenities adorn bookshelves. A curious modern cat sculpture pays homage to the fabled \"Hemingway Days\" of Key West. Exclusive collaborations with local artists fill The Marker and its grounds with a sense of whimsy. Renowned sculptor and Key West resident John Martini has created three eco-inspired pieces that represent indigenous animal inhabitants of the Keys – the marsh rabbit, the key deer, and exotic birds of all stripes – and underscore The Marker’s passion for preserving Key West’s natural beauty and fragile ecosystem. Key West artist Adam Russell has created a series of 7-foot tall sculptures — the Five Watchovers — that represent different elements of island history and culture, and stand tall and resilient over the property. They greet guests with totems of a pelican, historically symbol of good fortune for weary, homecoming sailors.</p><p style=\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-family: Arial, sans-serif; font-size: 15px; font-stretch: inherit; line-height: 25px; vertical-align: baseline; overflow: visible;\"><br style=\"\">Welcome. You’re home now.&nbsp;</p><p> </p>\n\t\t\t\t\t"}]