{
	"definition_id": "56092a983a97703d1e000001",
	"title": "It&rsquo;s a Six-Pack Celebration at Key West Brewfest!",
	"blogimage": {
		"url": "/assets/images/8942/original/tenresons.jpg"
	},
	"url_friendly_name": "10-reasons-to-visit-key-west-in-2015",
	"date": "2014-12-30",
	"categories": "Key West Events",
	"tags": [
		"Explorations"
	],
	"Posted_by": "Admin",
	"short_description": "It&rsquo;s a brand New Year, and hopefully one of your resolutions involves taking some overdue time off — … ",
	"more_content": "<p>It&rsquo;s a brand New Year, and hopefully one of your resolutions involves taking some overdue time off — somewhere far, far away from the daily hustle and bustle. That&rsquo;s a resolution you should plan to keep. At least it doesn&rsquo;t involve cutting carbs. There are a million reasons to make Key West your go-to destination, from our famous sunsets to our infamous nightlife. But we know the hardest part of planning a vacation is finding the time. So we&rsquo;ve taken a look ahead to 2015, outlining 10 signature festivals, special events, and annual soirees that will appeal to every visitor – from foodies to culture vultures. When you need to carve out some time to de-stress, here&rsquo;s where — and when — to start. <strong>Key West Literary Seminar</strong> <em>January 8 – 11</em> Every year, readers and authors from around the world converge on Key West for workshops, discussions, and parties that celebrate the power of the written word. This year&rsquo;s theme, &ldquo;How the Light Gets In: Literature of the Spirit,&rdquo; will reflect on the ability of language to capture the human experience, with award-winning writers like Wally Lamb (&ldquo;She&rsquo;s Come Undone&rdquo;) on hand. <strong>Key West Food &amp; Wine Festival</strong> <em>January 27 – February 1</em> Five days of epicurean excitement, this annual festival brings together some of Florida&rsquo;s top chefs and topnotch national wineries for a tasty lineup of events — from shrimp boils to &ldquo;wine around&rdquo; neighborhood strolls, rum sampling to a &ldquo;Pizza &amp; Prosecco&rdquo; jazz brunch. The Marker will be in the middle of it all, offering a Hospitality Suite and poolside wine tastings for VIP ticketholders. <strong>Tennessee Williams Birthday Celebration</strong> <em>March 2 – 31</em> The iconic playwright behind some of the stage world&rsquo;s most important successes (like &ldquo;Cat on a Hot Tin Roof,&rdquo; &ldquo;The Glass Menagerie&rdquo; and &ldquo;A Streetcar Named Desire&rdquo;), Williams was among the many artists who famously found inspiration in the tropical tranquility of Key West. Each year the island honors its famous visitor with a month-long series that includes film screenings of classic adaptations, staged readings, and poetry contests. <strong>Conch Republic Independence Celebration</strong> <em>April 17 – 26</em> Let it be known: Key West has quite the sense of humor. Back in 1982, islanders frustrated by a federal roadblock on Route 1 launched a tongue-in-cheek campaign to secede from the country and establish the Keys as the &ldquo;Conch Republic.&rdquo; Every year, a quirky lineup of events – including a drag race, pet stroll, Pirate&rsquo;s Ball, and parade — salutes the &ldquo;republic&rdquo; in humorous style. <strong>Key West Songwriter&rsquo;s Festival</strong> <em>May 6 – 10</em> The largest festival of its kind in the world, this massive music bash fills Key West beaches, bars, boats and theaters with the sound of songwriters and musicians who work in rock, country, pop and more. From established Grammy winners to talents on the verge of their big break, you&rsquo;ll discover over 100 unique artists with beer in hand and sun overhead. Sounds perfect. <strong>Key West Pride </strong> <em>June 10 – 14</em> Key West has always been a supportive haven for the LGBT community, but everyone always feels welcome at the annual Pride festivities, a colorful explosion of parades, dance parties, and live performances. Whether you hit the beach on a snorkeling excursion, pound the dance floor at a disco bash, or behold the bejeweled crowning of Miss Key West Pride, you&rsquo;ll spend this fun-filled week building friendships and memories. <strong>Hemingway Days</strong> <em>July</em> There&rsquo;s a special place in the heart of Key West for arguably our most famous former resident: Ernest Hemingway, the legendary author of classics like &ldquo;A Farewell to Arms.&rdquo; Though the exact dates of this annual mid-July celebration are TBD, you can expect the return of readings and the &ldquo;Running of the Bulls,&rdquo; a Marlin tournament and fish fry, an arm wrestling competition and a look-alike contest full of white-bearded &ldquo;Papa&rdquo; doppelgangers. <strong>Key West Brewfest</strong> <em>September (Labor Day weekend)</em> Spanning the holiday weekend and belong, the sixth annual installment of this suds-filled soiree will tap into the island&rsquo;s love of cold brews in the warm sun. Discover new local beers at beachside bars, pair your mug with munchies prepared by talented local chefs, hit sunset parties, or sip your way through crawls of Key West nightspots. And it&rsquo;s the perfect time to discover Waterfront Brewery, a crafty newcomer just steps from The Marker. <strong>Fantasy Fest</strong> <em>October</em> Imagine Halloween with fewer ghosts, more glitter. Add body paint, outrageous costumes, parades and street fairs filled with revelers celebrating a unique theme — like &ldquo;Anime-ted Dreams &amp; Adventures&rdquo; and &ldquo;Villains, Vixens &amp; Vampires.&rdquo; Perhaps Key West&rsquo;s most nationally well-known festivals, this adults-geared extravaganza skews to the ribald and racy, bringing the island a bit of Mardi Gras-style spectacle. <strong>Super Boat International, Key West World Championship</strong> <em>November 8 – 15</em> Billed as &ldquo;the world&rsquo;s biggest and fastest offshore racing series,&rdquo; this wave-crushing championship caps the end of a year&rsquo;s worth of competitions. Boat enthusiasts and anyone with a need for speed descend on Key West for a week&rsquo;s worth of races that are a sight to behold.</p>",
	"blogimage_id": 8942,
	"_delete_blogimage": null,
	"definition": ""
}