{"definition_id":"56092a983a97703d1e000001","title":"20 Days, 20 Ways to Celebrates","blogimage":{"url":""},"url_friendly_name":"20-days-20-ways-to-celebrate","date":"2014-12-22","categories":"Key West Events","tags":["Explorations","Key West Events"],"Posted_by":"Admin","short_description":"With last week&rsquo;s official grand opening, The Marker made history. We&rsquo;re the first new hotel built in Old … ","more_content":" <p>With last week&rsquo;s official grand opening, The Marker made history. We&rsquo;re the first new hotel built in Old Town Key West in 20 years!</p>\n  <p>To celebrate, we&rsquo;ve launched a special series called &ldquo;20 Days at the Marker.&rdquo; From rum tastings to massages, each day offers a unique opportunity to discover different talented locals who make Key West special. You can check out an abbreviated calendar here. But here&rsquo;s a full guide to what you&rsquo;ll find – and some 20-related trivia about each exciting event.</p>\n  <p><strong>20 Percent</strong><br>\n    <em>That&rsquo;s how much of your beer drinking will be craft brews by 2020. </em></p>\n  <p>Move over, mass market beer. The craft brew movement has exploded across America, and here&rsquo;s a sudsy surprise: The Brewers Association, the industry&rsquo;s national organization, expects craft beers to represent 20% of total beer on shelves by the year 2020. So get on trend, and wrap your koozie around a frosty glass from<strong> Islamorada Beer Company</strong>. The team behind the Florida Keys&rsquo; top craft brewery will be offering a <strong>Happy Hour Beer Tasting</strong> with varieties like the &ldquo;Sandbar Sunday,&rdquo; a relaxing, citrusy ale that will quench any thirst.<br>\n    <strong>When: Fridays, December 12 &amp; 19 (4-6 PM)</strong></p>\n  <p><strong>20 Years Old</strong><br>\n    <em>That was Lloyd Mager&rsquo;s age when he first visited Key West in 1972. He&rsquo;s been here ever since.</em></p>\n  <p>Like countless others, the New Jersey native fell in love with island life: the sun, the surf, and the wild mix of friendly faces. Today, Mager shares his love of Key West through <strong>Lloyd&rsquo;s Tropical Bike Tours</strong>, which offers easy, two-hour tours of the island&rsquo;s exotic beauty. Not in the mood to pedal? Guests of The Marker don&rsquo;t have to go further than the pool. Mager will come to us for <strong>Coconuts, Conchs &amp; Characters</strong>, where you can join him for fresh coconut tastings, conch shell blowing — and many colorful stories from a local expert on all things Key West.<br>\n    <strong>When: Saturday, December 13 and Thursdays, December 18 &amp; 25 (2-4 PM)</strong></p>\n  <p><strong>20 Years</strong><br>\n    <em>That&rsquo;s how long the Schooner Hindu spent on the sea before becoming a tourist vessel.</em></p>\n  <p>From 1925 through 1945, the historic ship went through many different uses. It was a private yacht. It traded spices between India and Boston. It even engaged German U-boats during World War II. Then in 1946, the impressive ship settled in Provincetown, Massachusetts, a seaside community not unlike Key West, where it entered a new era as a tourist attraction: first for whale watching and now, under the ownership of Key West&rsquo;s William Rowan, a floating piece of history that offers daily sails to visitors. During <strong>Definitely Knot Work</strong>, guests will learn the basics boat knots, then hop on board for a tour or sunset cruise.<br>\n    <strong>When: Sundays, December 14, 21 &amp; 28 (2-4 PM)</strong></p>\n  <p><strong>20 Inches</strong><br>\n    <em>That&rsquo;s the approximate length of a standard ukulele.</em></p>\n  <p>Size doesn&rsquo;t matter. Small but mighty, the gentle strumming of this traditional island instrument immediately brings to mind a tropical paradise. Want to teach yourself a simple strum? Check out <strong>Uke Can Do It!</strong>, a fun overview on the basics from Key West artist Gretchen Mills. Or just kick back and relax, letting each note soothe you like a lapping wave.<br>\n    <strong>When: Mondays, December 15, 22 &amp; 29 (1-3 PM)</strong></p>\n  <p><strong>20 Dollars</strong><br>\n    <em>That&rsquo;s about how much you&rsquo;ll save in souvenirs when you design your own t-shirt.</em></p>\n  <p>You&rsquo;ll want a keepsake of your Key West vacation. But while local shops are stocked with t-shirts, it can be a chore to wade through all the kitschier options. (&ldquo;Is that a — <em>sequined flamingo</em>?&rdquo;) Save the time and money, and join our pals from <strong>COAST Projects</strong>, a cool collective of surfside artists and music lovers, for <strong>Sun. Screen. Print</strong>. You&rsquo;ll have a chance to make your own shirt, one that captures your Key West getaway. And one you won&rsquo;t just wear to bed.<br>\n    <strong>When: Tuesdays, December 16, 23 &amp; 30 (1-3 PM)</strong></p>\n  <p><strong>1920</strong><br>\n    <em>That&rsquo;s the year Prohibition started in America, and Key West became a rumrunner&rsquo;s paradise.</em></p>\n  <p>As you wander between the fun, festive bars on Duval Street, it&rsquo;s hard to imagine that, once upon a time, it was illegal to enjoy a Key West sunset with a cocktail in your hand. (The horrors!) Unwilling to stop the party, the Keys enjoyed a colorful history of bootlegging rum during the Prohibition Era. But it wasn&rsquo;t until last year, when local restaurateur Paul Menta launched <strong>Chef Distilled</strong>, that Key West received its first legal rum distillery. Menta brought his culinary background to the booze-making process, using Florida sugar cane with infusions like coconut, vanilla crème brûlée and Key lime. And his team of modern rumrunners will guide you through the flavors during <strong>Rum Rum in the Sun!</strong><br>\n    <strong>When: Wednesdays, December 17, 24 &amp; 31 (4-6 PM)</strong></p>\n  <p><strong>20 Minutes</strong><br>\n    <em>That&rsquo;s all it takes for yoga to boost your brainpower.</em></p>\n  <p>And no, it&rsquo;s not because &ldquo;Downward Dog&rdquo; made all the blood rush to your head. According to researchers, a single 20-minute yoga session is all it takes to give yourself a shot of heightened focus and memory. (Better than downing another cup of espresso!) <strong>Key West Yoga Sanctuary</strong> is one of the island&rsquo;s finest retreats to find centering yoga sessions that will clear your mind and wash away stress. But if you&rsquo;re not a yogi yet, don&rsquo;t worry. For <strong>Relax… You&rsquo;re in Key West</strong>, instructor Anne Walters will visit The Marker to soothe poolside guests with relaxing chair massages. <strong>When: Saturdays, December 19 &amp; 26 (1-3 PM)</strong></p>","blogimage_id":"8932","_delete_blogimage":"0","definition":"","map":{"url":""},"image":{"url":""}}