{"definition_id":"56092a983a97703d1e000001","title":"A Taste of Cuban Coffee in Key West","blogimage":{"url":""},"url_friendly_name":"a-taste-of-cuban-coffee-in-key-west","date":"2016-04-05","categories":"","tags":[],"Posted_by":"Admin","short_description":"We&rsquo;re big on coffee at The Marker, and we can&rsquo;t stop raving about the Cuban coffee selections we have right here in Key West. ","more_content":"<h3>A\nTaste of Cuban Coffee in Key West</h3><p>We&rsquo;re big on coffee at The Marker, and we can&rsquo;t stop raving about the Cuban coffee selections we have right here in Key West.&nbsp;</p><p> We have some recommendations on where to score this delicious brew but first, a little history! After espresso machines were first <a href=\"http://\">imported to Cuba from Italy</a>, many coffee drinks in Key West began using Cuban espresso as a base. The most common preparation of Cuban coffee is a Café con Leche, which is essentially espresso and steamed milk. This rich, creamy drink is the perfect eye-opener for a Key West morning. There is also the standard Cortadito preparation of Cuban espresso, which is prepared to your desired ratio of steamed milk and espresso. Now that you know the story, let&rsquo;s get to the recommendations! Below are some of our top local spots to get a taste of that Cuban coffee flavor.</p><h3>Cuban Coffee Queen&nbsp; </h3><p><a href=\"http://www.cubancoffeequeen.com/\">Cuban Coffee Queen</a> Offers an extensive roster of <a href=\"http://www.cubancoffeequeen.com/coffee-drinks\">Cuban coffee beverages</a>, making it a can&rsquo;t miss spot in Key West! &nbsp;With the cheeky slogan, &ldquo;drink more Cuban coffee and do stupid things faster,&rdquo; you can&rsquo;t help but notice <a href=\"http://www.cubancoffeequeen.com/\">Cuban Coffee Queen&rsquo;s</a> strong personality (and even stronger coffee!) Choose from a 12oz or 16oz of &nbsp;Café <a href=\"http://\">Con Leche</a>, and in true Havana spirit, dunk a toasted, buttered slice of Cuban bread in the steaming cup of coffee! We also recommend the Cortadito, a double Cuban espresso with cane sugar and steamed milk. Uniquely, Cuban Coffee Queen offers <a href=\"http://www.cubancoffeequeen.com/coffee-drinks\">Bucci</a>, which is the quintessential espresso shot of the Cuban coffee world. The strong fragrant and tangy flavors are paired with cane sugar, then served in a shot sized cup. The <a href=\"http://www.cubancoffeequeen.com/coffee-drinks\" class=\"\">Colada</a> is a double Bucci that packs a punch and might be better shared amongst friends if you can&rsquo;t handle the caffeine. We kept the best news for last, the Cuban Coffee Queen is just a stone&rsquo;s throw from The Marker Resort, making it a great first stop on your way to explore Key West!&nbsp;</p><h3> Sandy&rsquo;s Cafe&nbsp;</h3><p>Just a few minutes drive from The Marker is <a href=\"http://www.kwsandyscafe.com/history/\">Sandy&rsquo;s Café</a>, offering Café con Leche and Cortadito in their traditional forms, while also serving an iced Café con Leche. To compliment the Cuban flavors of the strong coffee, try the Cuban wrap, a delectable mix of salami, pork, ham, cheese, mayo, mustard, and tangy pickles!&nbsp;</p><h3> 5 Brothers</h3><p>This <a href=\"https://www.facebook.com/5-Brothers-Key-West-141399224055/\">grocery and sandwich shop</a> is a true local gem. <a href=\"http://5brothersgrocery.tripod.com/\">5 Brothers</a> is the perfect spot for a breakfast sandwich and a piping hot cup of Cuban coffee (especially after a night out on Duval street!) For more food options with authentic Cuban flavors choose from Cuban toast, or the <a href=\"http://www.keywesttravelguide.com/5-brothers-grocery-sandwich-shop/\">Frita</a> <a href=\"http://www.keywesttravelguide.com/5-brothers-grocery-sandwich-shop/\">Cubana</a>, a sandwich complete with onions, ketchup, and potato sticks.</p><h3> Cuban Coffee at Home&nbsp;</h3><p><a href=\"http://www.babyscoffee.com/\" class=\"\">Baby&rsquo;s Coffee</a> offers a wide assortment of take home ready aromatic blends and pungent flavors, so that you can get a taste of Key West coffee even after the vacation is over. For true Key West inspired flavor, we suggest blends like <a href=\"http://www.babyscoffee.com/coffee/babys-conch-republic-coffee-detail.html\">Conch Republic</a>, <a href=\"http://www.babyscoffee.com/coffee/babys-key-west-old-town-roast-detail.html\">Baby&rsquo;s Key West Old Town Roast</a>, or <a href=\"http://www.babyscoffee.com/coffee/babys-cuban-roast-detail.html\">Baby&rsquo;s Cuban Roast</a> (which has a stronger tang than their Havana or espresso flavors!) &nbsp;</p><p> While you may have heard about Cuban coffee while passing through Florida or the Keys, we feel you truly get a rich taste of Havana when you&rsquo;re in the Southernmost city. If your visit is still in the distant future, don&rsquo;t fret! Follow us on <a href=\"https://www.instagram.com/themarkerresort/\" class=\"\">Instagram</a>, @TheMarkerResort, for your Key West fix of everything from palm trees and poolside views to photogenic Café con Leches!&nbsp;</p>","blogimage_id":"9658","_delete_blogimage":"0","definition":""}