{
	"definition_id": "56092a983a97703d1e000001",
	"title": "Art of Key West",
	"blogimage": {
		"url": "/assets/images/9272/original/The_Marker_Hotel_22.jpg"
	},
	"url_friendly_name": "art-of-key-west",
	"date": "2015-11-04",
	"categories": "Uncategorized",
	"tags": [],
	"Posted_by": "The Marker Resort",
	"short_description": "Key West is a known destination for many things—beautiful blue waters, key lime pie, and rich history...",
	"more_content": "<div><p>Key West is a known destination for many things—beautiful blue waters, key lime pie, and rich history. But what many locals know (and many visitors find out) is that Key West is home to thriving art scene. With coastal influences and tropic inspirations, it makes sense why art and Key West go hand in hand. At The Marker Resort, we embrace local artists who embody the essence of Key West. Upon arriving at our resort, you will spot the vibrant installation, &ldquo;5 Watchers&rdquo; by Key West Pottery&rsquo;s Adam Russell. Since his arrival in the Keys 6 years ago, Russell&rsquo;s work has been in high demand keeping him busier than ever, with just enough time to catch a Key West sunset. We were able to steal some time with the sculptor to hear his connection to the buzzing southern-most art scene and <a href=\"/best-things-to-do-in-key-west\">some of the best things to do in Key West.&nbsp;</a></p></div><div style=\"\"><p><i><b>How were you introduced to the Key West art community?</b></i></p></div><div style=\"\"><p>I was invited to the island as an Artist in Residence at the Studios of Key West in 2009. During that residency I became quite infatuated with this magical rock. My wife and I decided that we&rsquo;d like to give this lifestyle a try. We moved to the island and opened our studio a month later.</p></div><div style=\"\"><p><b><i>What is the more unique quality or theme amongst Key West art and/or its community?</i></b></p></div><div style=\"\"><p>When I look at the Arts in Key West I see there are a lot of people here who have reinvented themselves, which is easier said than done. It&rsquo;s an ongoing theme with us, that passionate sense of freedom (bordering on rebellion in some cases) really comes out in the artwork I see. Vibrant colors and spaces depict an exploratory creative self who is not only searching, but finding as well. As part of that, artists on the island don&rsquo;t seem afraid of depicting beauty, which in other areas of the ‘art world&rsquo; can be very difficult to navigate. Overall, I really appreciate the sincerity of the creatives here. I am often struck by people&rsquo;s work because I can tell that they really mean it, they love it, and it has real imagination involved in its making.</p></div><div style=\"\"><p><b><i>What was your inspiration behind your installation of the 5 Watchovers at the entrance of The Marker?</i></b></p></div><div style=\"\"><p>My installation at The Marker is a part of an ongoing series of works that I've been making for the last few years, called 'The Watchovers'. My work overall is really about an ancient continuity, whereas, the monuments in days of old we're about a connection; between man, place, and feeling. So in short, each of these &ldquo;5 Watchovers\" represents a guardian for each of 5 aspects that we determined appropriate for this place specifically.&nbsp;</p></div><div style=\"\"><p>In this grouping we included: The Watchover of the Navigator, The Watchover of the Feeling, The Watchover of the Conch Republic, The Watchover of the Red Sky, and the Watchover of the Surrounding Life. Each tower is stacked with imagery and meaning leading up to a quiet Pelican, who sits on top with a marshal but calm eye of protection for his surroundings. The inspiration is two fold; I am heavily referencing very traditional ideas from art history within this concept and at the same time, this is what one actually observes in the real world! These pelicans on patrol, perched up high. Smarter, quicker, and more comfortable than many of their avian counterparts, they seemed like the perfect local archetype.</p></div><div style=\"\"><p><b><i>How has Key West informed your artistic style?</i></b></p></div><div style=\"\"><p>As an artist I make a conscious effort to connect with others on the basis of our commonality. Place is supremely important in that equation and this place has a lot of components to it. It is quite beautiful in a physical way, but as one integrates there is a serious magic to its feeling, its history, and its culture. To connect with that more subtle essence is what I want to concern myself with primarily. But not only as a consumer, with my work I am trying to respectfully produce this culture as well. To be effective at that takes real connection and real connection is only earned. Key West has not only shown me a palette for color and shape, but it has involved me in a place where I feel at home and has allowed me to speak in commonalities with an audience who feels that way too.</p></div><div style=\"\"><p><b><i>How has Key West benefited from the rich arts community?</i></b></p></div><div style=\"\"><p>I think Key West is shaped by potent, visceral experiences. Whether one is sailing, diving, reading, working, or relaxing the intensity of experience is elevated in a place like this. Its geography and geology, its remoteness and physical beauty all add into the allure for people from all persuasions. You will find artists in places like this all over the world, for the reason that it draws the creative mind in for discovery and by that very principal grows a creative community vital to its cultural identity. That cultural identity is a self fulfilling cycle, steadily drawing in what it needs to keep going. Art is about connection and so is Key West.&nbsp;</p></div><div style=\"\"><p><b><i>What art spots are a must see for visitors of Key West?&nbsp;</i></b></p></div><div style=\"\"><p>Fort Zachary Taylor State Park, tops my list! One of the most restful, beautiful spots in the islands if you ask me. I also, really encourage visitors to engage with the local creatives— galleries, restaurants, playhouses, museums etc. of which there are many. When you dig in, there is a lot of great creative spirit to this place. We are a uniquely open local community, meaning there is no intellectual prerequisite for being included in the Arts, you just need to show up with your mind open. At the same time, its not all fluff. There is a truly world class population of people who spend there lives in Key West producing real culture that affects an area much larger than this little island. We are all here.</p></div><div style=\"\"><p>For when you aren&rsquo;t visiting Key West Pottery to visit Adam, or his Key West pick Fort Zachary Taylor, these are some of the best places to experience the <a href=\"/key-west-art-heritage\">Key West </a>art scene:</p></div><div style=\"\"><p><u>The Studios Key West</u></p></div><div style=\"\"><p><a href=\"https://tskw.org/\">The Studios Key West</a> is a creative space (art center) for classes, exhibits, events, and residencies for all types of artists. The Studios aims for community development by nurturing artists through their artist-in-residency offering. The program instils personal and artistic growth while drawing inspiration from the rich Key West backdrop. Awarded artists create vivid art by day, and stay in cottages on the outskirts of The Studio by night.&nbsp;</p></div><div style=\"\"><p><u>Key West Art &amp; Historical Society</u></p></div><div style=\"\"><p>The Key West Art &amp; Historical Society hosts more than &ldquo;25,000 objects spanning from postcards, photographs, paintings, artifacts, textiles, ordnance, and archives.&rdquo; Uniquely, the KWAHS offers an <a href=\"http://www.kwahs.org/exhibitions/online-exhibitions/\">online portal</a> to look at exhibits of Key West art. Most notable is Mario Sanchez&rsquo;s acclaimed painted wood carvings, and the infamously haunted Robert the Doll.</p></div><div style=\"\"><p><u>Wyland Galleries</u></p></div><div style=\"\"><p>Situated on the heart of Duval Street is the largest <a href=\"http://wylandkw.com/galleries\" class=\"\">Wyland Gallery</a> in the world. The gallery is known for its bronzes sculpture of marine life and artistic renderings of the Key West environment. Stop by and pick up some artful souvenirs to commemorate your stay in Key West.&nbsp;</p></div>\n",
	"blogimage_id": "9272",
	"_delete_blogimage": "0",
	"image_id": "9282",
	"_delete_image": "0",
	"definition": "",
	"image": {
		"url": "/assets/images/9282/original/The_Marker_Hotel_22.jpg"
	}
}