{"definition_id":"56092a983a97703d1e000001","title":"The Marker Resort Selected to Conde Nast Traveler Readers Choice","blogimage":{"url":""},"url_friendly_name":"Conde-nast-traveler","date":"2015-12-02","categories":"","tags":[],"Posted_by":"Admin","short_description":"More than 128,000 Conde Nast Traveler Readers have spoken—and they&rsquo;re all humming the same tune...","more_content":"<p class=\"MsoNormal\" style=\"line-height:16.0pt;mso-pagination:none;mso-layout-grid-align:\nnone;text-autospace:none\">More than 128,000 <a href=\"http://www.cntraveler.com/travel-awards/readers-choice-awards/2015\">Conde Nast Traveler\nReaders</a> have spoken—and they&rsquo;re all humming the\nsame tune: The Marker Waterfront Resort is a standout amongst Florida hotels, sitting\nat #12 among the 24 top resorts in Florida that were awarded. The annual survey,\nnow in its 28th year, received an all-time high percentage of responses\ncomplete with first-hand insights and comments. According to Conde Nast\nTraveler&rsquo;s <a href=\"http://www.cntraveler.com/travel-awards/readers-choice-awards/2015\" class=\"\">site</a>,\nthis year readers, &ldquo;declared a passion for the authentic, the personalized, and\nthe unexpected.&rdquo; From our candidly authentic Keys experience, to being one of\nthe best known <a href=\"/weddings\" class=\"\">wedding venues in Key West</a>,\nit&rsquo;s clear that readers are loving The Marker Resort.</p><p>\n\n</p><p class=\"MsoNormal\" style=\"line-height:16.0pt;mso-pagination:none;mso-layout-grid-align:\nnone;text-autospace:none\">&nbsp;</p><p>\n\n</p><p class=\"MsoNormal\" style=\"margin-bottom:12.0pt;line-height:16.0pt;mso-pagination:\nnone;mso-layout-grid-align:none;text-autospace:none\">When\nasked about the honor, our Complex Director of Sales &amp; Marketing, Michael\nDwyer stated, &ldquo;Our fantastic location, right in the heart of Key West&rsquo;s\nhistoric Old Town, has inspired our approach to providing guests with luxurious\naccommodations that reflect the culture, heritage and spirit of the tropical\noasis we are proud to call our home.&rdquo;</p><p>\n\n</p><p class=\"MsoNormal\" style=\"line-height:16.0pt;mso-pagination:none;mso-layout-grid-align:\nnone;text-autospace:none\">What truly exemplifies The Marker\nexperience, is also what sets it apart from other <a href=\"http://www.themarkerkeywest.com/\">Key West resorts.</a>\nAfter opening less than a year ago, it stands as one of the newest builds in\nthe Southernmost city since 1994. Our guest experience embodies the attitude of\nthe Keys—luxury, with a laidback feel. We treat guests to top-of-the-line amenities\nand authentic local activities. There are so many local offerings, quaint\nshops, and specialized tours, and we encourage and connect our guests to partake\nin the vibrant community. We want couples to enjoy the\ntranquility of our grounds away from their busy work life by sipping champagne\nand enjoying a warm weathered Key West night. \"We want families to enjoy days at <a href=\"http://www.keywestaquarium.com/\" class=\"\">The Key West Aquarium</a>\nand <a href=\"http://www.keywestseaport.com/\" class=\"\">Historic\nSeaport</a>, and comeback to one of our pools to\nunwind (making sure that the parents have margaritas in hand!) At The Marker Resort, it&rsquo;s not just about the amenities, but the dedication\nto contribute to the Key West community as a whole. At the heart of The Marker\nResort&rsquo;s aesthetic is the influence of <a href=\"/blog-details/art-of-key-west\">local\nartists and artisans</a>, as well as the vibrant colors that pulse\nthrough the town. Whether padding across our two acres of tropical backdrop or\nrelaxing by one of the three private swimming pools, it&rsquo;s easy to understand\nwhy The Marker Resort is a top spot amongst guests, readers, and friends.&nbsp;</p><p><br></p>","blogimage_id":"9437","_delete_blogimage":"0","definition":""}