{"definition_id":"56092a983a97703d1e000001","title":"Eat Your Heart Out in Key West","blogimage":{"url":"/assets/images/8952/original/themarkerhotel.jpg"},"url_friendly_name":"eat-your-heart-out-in-key-west","date":"2015-01-21T00:00:00Z","categories":"Uncategorized","tags":[],"Posted_by":"Admin","short_description":"It&rsquo;s always bathing suit weather in Key West. But this month, all dieting efforts are strictly off limits. … ","more_content":"<p>It&rsquo;s always bathing suit weather in Key West. But this month, all dieting efforts are strictly off limits. (It&rsquo;s okay. Consider this your formal notice.) The <strong>Key West Food &amp; Wine Festival</strong> takes over the island from <strong>January 27 through February 1</strong>, and the forecast calls for: indulgence.</p>\n<p>The Marker is an epicenter of activity for the annual event, which brings together dozens of top area chefs and acclaimed vintners from throughout the country. We&rsquo;ve partnered with the Festival to host the <strong>Mile 0 Grand Tasting</strong> on Friday, January 30, a signature experience that features unique wines sipped poolside on the resort&rsquo;s lush, tropical flower-filled grounds. (Drunk in love yet?) And it will also be an opportunity to sample hors d&rsquo;oeuvres from Cero Bodega, The Marker&rsquo;s Mexican-Californian restaurant, including crispy chicken lollipops with tamarind glaze, scallop fritters with a Sriracha aioli, and seared ahi tuna with a wasabi and ponzu vinaigrette. Grand Tasting tickets are typically $125, but guests of The Marker receive a steep discount: $95, plus 10% off any additional Food &amp; Wine Festival events.</p>\n<p>In fact, The Marker is your one-stop source for all things fest-related. We&rsquo;ve dedicated a space to serve as the event&rsquo;s Hospitality Suite, open daily from 10 AM to 3 PM as a place to pick up tickets, find information on festival happenings, book restaurant reservations, ask questions and mingle with fellow food lovers. The Suite is open to the public.</p>\n<p>But move fast to grab tickets for some of the most popular festival events. Other highlights include a tasting with local distiller Legal Rum; a &ldquo;Pizza &amp; Prosecco&rdquo; Sunday Jazz Brunch at the new restaurant Roostica (catch a complimentary trolley at the Hospitality Suite); the culinary competition &ldquo;Last Chef Standing&rdquo;; and even a day of coconut bowling.</p>\n<p>For a full lineup of events, visit <a href=\"http://www.keywestfoodandwinefestival.com\" target=\"_blank\">keywestfoodandwinefestival.com</a>.</p>\n<p>Then give us a ring. We&rsquo;ll save you a seat at the dinner table — but first, you need a bed.</p>","blogimage_id":8952,"_delete_blogimage":null,"definition":""}