{"definition_id":"56092a983a97703d1e000001","title":"Holidays in Key West","blogimage":{"url":"/assets/images/9444/original/holiday.jpg"},"url_friendly_name":"holidays-in-keywest","date":"2015-12-08T00:00:00Z","categories":"","tags":[],"Posted_by":"Admin","short_description":"The holidays without snow? It may sound a little offbeat to those who have more frequently enjoyed a White Christmas, but in Key West we personally think it&rsquo;s the best way to spend the holiday.","more_content":"<p class=\"MsoNormal\">The holidays without snow? It may sound\na little offbeat to those who have more frequently enjoyed a White Christmas,\nbut in Key West we personally think it&rsquo;s the best way to spend the holiday.\nAfter all it&rsquo;s a season that&rsquo;s truly about relaxation and reflection. What\nbetter place to get away from the cold hustle and bustle than Key West? Below\nwe&rsquo;ve outlined some of the best holiday events in Key West that keep people\ncoming back year after year. Thanks to a packed calendar of fantastic December activities,\neven with all the palm trees, Key West begins to look a lot like Christmas.&nbsp;</p><p class=\"MsoNormal\" style=\"\"><b>Holiday Drinks at The Marker: Starting Monday, Dec 7th</b></p>\n\n<p class=\"MsoNormal\">We&rsquo;re serving up frosty temperatures\nin the Key West heat at The Marker Resort. We&rsquo;re talking about chilled drinks,\nlike our signature Winter Chill, a combination of citrus vodka, blue curacao,\ntriple sec, and a splash of lime for a little zest, served over ice. Holiday\nspins on classic drinks will be offered with our Johnnie Walker Black Sour and\nFrozen Cranberry Margarita. Our Merry Berry Christmas, Sugar! Is a delectable\nnon-alcoholic drink, with the perfect chilled mixture of berries, simple syrup,\nlime, ginger ale, it&rsquo;s a tasty treat all can enjoy! With all these options, there&rsquo;s\nsomething for each and every one of our guests to toast the holidays at The\nMarker Resort.</p><p class=\"MsoNormal\"><b>Friday, December 11th and 18th: <a href=\"http://www.fla-keys.com/news/news.cfm?sid=8563\">Historic Holiday Inn Tours</a> 6pm – 8:30pm</b></p><p>\n\n</p><p class=\"MsoNormal\">Take a tour of 6 different local inns\ndecked out with holiday lights and decorations. For the past decade the Key\nWest Innkeepers Association has presented visitors with inns embodying the holiday\nspirit, featuring Key West&rsquo;s unique architecture.</p><p class=\"MsoNormal\" style=\"\"><b>Saturday, December 12th: Truman Foundation presents Tinsel and Tunes 5pm</b></p><p class=\"MsoNormal\" style=\"\">\n\n</p><p class=\"MsoNormal\">Catch the American Bombshells, known for\ntheir appearances on the Today Show and CNN, live in concert for an All-American\nspectacular. Returning to Key West In Tinsel\nand Tunes, the American Bombshells will sing holiday favorites live from the Little White House Lawn.</p><p class=\"MsoNormal\" style=\"\"><b><a href=\"http://www.trolleytours.com/key-west/holiday-tour.asp\">Holiday Trolley Tour</a>: Running Dec. 12, 13, 17, 18, 19,\n21, 22, 23. 6pm</b></p><p class=\"MsoNormal\" style=\"\">\n\nAfter you&rsquo;ve seen the inns and boats of Key West, why\nnot catch the rest of the town decked out in holiday décor? Sing carols around\nthe island alongside tourists and locals alike to get a true sense of how The Keys\ndo Christmas</p><p class=\"MsoNormal\" style=\"\"><b>Sunday, December 20th: Holiday Artisan Market</b></p><p class=\"MsoNormal\" style=\"\">\n\nGift your loved ones a piece of Key West from the\nHoliday Artisan Market—there&rsquo;s truly something for everyone on your list! Buy fresh\nproduce, sample baked goods and cheeses, and enjoy homemade furniture,\nclothing, and jewelry! Even that &ldquo;hard to buy for&rdquo; relative on your list will\nlove a gift from the Holiday Artisan Market, leaving more time to unwind by the\npool and less time stressing over last minute shopping!</p><p class=\"MsoNormal\" style=\"\"><b><a href=\"/calendar-more/movie-night-at-the-marker-8pm\" class=\"\">Monday, December 21st: Movie Night at the Marker 8pm&nbsp;</a></b></p><p class=\"MsoNormal\" style=\"\">\n\n</p><p class=\"MsoNormal\">Spend the evening sipping signature\nholiday cocktails while watching holiday favorite Elf at The Marker! It&rsquo;s a perfect evening for families and couples\nalike to usher in the season with a little holiday nostalgia and of course,\nlots of smiles! Take a note from Buddy the elf, &ldquo;the best way to spread\nChristmas cheer, is singing loud for all to hear!&rdquo;&nbsp;</p><p class=\"MsoNormal\" style=\"\"><b>Thursday, December 24th: <a href=\"http://www.rustylemmon.com/\">Rusty\nLemmon</a> poolside at the Marker</b> </p><p class=\"MsoNormal\" style=\"\">\n\n</p><p class=\"MsoNormal\">Catch local favorite, Rusty Lemmon, poolside\nat The Marker singing island classics\nand holiday tunes. Groove along with a holiday cocktail in hand while dipping\nyour feet in the pool. It&rsquo;s sure to be one of the most relaxing ways to unwind\non Christmas Eve.&nbsp;</p><p class=\"MsoNormal\" style=\"\"><b>Thursday, December 31st: &nbsp;New Year&rsquo;s Eve</b></p><p class=\"MsoNormal\" style=\"\">\n\nSpend New Years Eve on the rooftop of Sloppy Joe&rsquo;s for the 23rd annual Conch\nShell Drop!&nbsp; Or, join the crowds in front of Bourbon\nStreet Pub for the annual Shoe Drop. Watch as the world famous Drag Queen Sushi is\nlowered into what else, a red shoe, at the stroke of midnight. Wherever you\nspend your New Year&rsquo;s Eve in Key West, you are bound to see that the people of The\nKeys know how to unforgettably usher in the New Year. &nbsp; </p><p class=\"MsoNormal\" style=\"\"> </p><p> </p>","blogimage_id":"9444","_delete_blogimage":"0","definition":""}