{"definition_id":"56092a983a97703d1e000001","title":"Holidays in Key West","blogimage":{"url":"/assets/images/9444/original/holiday.jpg"},"url_friendly_name":"holidays-in-keywest","date":"2015-12-08","categories":"","tags":[],"Posted_by":"Admin","short_description":"The holidays without snow? It may sound a little offbeat to those who have more frequently enjoyed a White Christmas, but in Key West we personally think it&rsquo;s the best way to spend the holiday.","more_content":"<p class=\"MsoNormal\">The holidays without snow? It may sound a little offbeat to those who have more frequently enjoyed a White Christmas, but in Key West we personally think it&rsquo;s the best way to spend the holiday. After all it&rsquo;s a season that&rsquo;s truly about relaxation and reflection. What better place to get away from the cold hustle and bustle than Key West? Below we&rsquo;ve outlined some of the best holiday events in Key West that keep people coming back year after year. Thanks to a packed calendar of fantastic December activities, even with all the palm trees, Key West begins to look a lot like Christmas.&nbsp;</p>\n<p class=\"MsoNormal\"><strong>Holiday Drinks at The Marker: Starting Monday, Dec 7th</strong></p>\n<p class=\"MsoNormal\">We&rsquo;re serving up frosty temperatures in the Key West heat at The Marker Resort. We&rsquo;re talking about chilled drinks, like our signature Winter Chill, a combination of citrus vodka, blue curacao, triple sec, and a splash of lime for a little zest, served over ice. Holiday spins on classic drinks will be offered with our Johnnie Walker Black Sour and Frozen Cranberry Margarita. Our Merry Berry Christmas, Sugar! Is a delectable non-alcoholic drink, with the perfect chilled mixture of berries, simple syrup, lime, ginger ale, it&rsquo;s a tasty treat all can enjoy! With all these options, there&rsquo;s something for each and every one of our guests to toast the holidays at The Marker Resort</p>\n<p class=\"MsoNormal\"><strong>Friday, December 11th and 18th: <a href=\"http://www.fla-keys.com/news/news.cfm?sid=8563\">Historic Holiday Inn Tours</a> 6pm &ndash; 8:30pm</strong></p>\n<p>&nbsp;</p>\n<p class=\"MsoNormal\">Take a tour of 6 different local inns decked out with holiday lights and decorations. For the past decade the Key West Innkeepers Association has presented visitors with inns embodying the holiday spirit, featuring Key West&rsquo;s unique architecture.</p>\n<p class=\"MsoNormal\"><strong>Saturday, December 12th: Truman Foundation presents Tinsel and Tunes 5pm</strong></p>\n<p class=\"MsoNormal\">&nbsp;</p>\n<p class=\"MsoNormal\">Catch the American Bombshells, known for their appearances on the Today Show and CNN, live in concert for an All-American spectacular. Returning to Key West In Tinsel and Tunes, the American Bombshells will sing holiday favorites live from the Little White House Lawn.</p>\n<p class=\"MsoNormal\"><strong><a href=\"http://www.trolleytours.com/key-west/holiday-tour.asp\">Holiday Trolley Tour</a>: Running Dec. 12, 13, 17, 18, 19, 21, 22, 23. 6pm</strong></p>\n<p class=\"MsoNormal\">After you&rsquo;ve seen the inns and boats of Key West, why not catch the rest of the town decked out in holiday d&eacute;cor? Sing carols around the island alongside tourists and locals alike to get a true sense of how The Keys do Christmas</p>\n<p class=\"MsoNormal\"><strong>Sunday, December 20th: Holiday Artisan Market</strong></p>\n<p class=\"MsoNormal\">Gift your loved ones a piece of Key West from the Holiday Artisan Market&mdash;there&rsquo;s truly something for everyone on your list! Buy fresh produce, sample baked goods and cheeses, and enjoy homemade furniture, clothing, and jewelry! Even that &ldquo;hard to buy for&rdquo; relative on your list will love a gift from the Holiday Artisan Market, leaving more time to unwind by the pool and less time stressing over last minute shopping!</p>\n<p class=\"MsoNormal\"><strong><a class=\"\" href=\"../../../../../../../../calendar-more/movie-night-at-the-marker-8pm\">Monday, December 21st: Movie Night at the Marker 8pm&nbsp;</a></strong></p>\n<p class=\"MsoNormal\">&nbsp;</p>\n<p class=\"MsoNormal\">Spend the evening sipping signature holiday cocktails while watching holiday favorite Elf at The Marker! It&rsquo;s a perfect evening for families and couples alike to usher in the season with a little holiday nostalgia and of course, lots of smiles! Take a note from Buddy the elf, &ldquo;the best way to spread Christmas cheer, is singing loud for all to hear!&rdquo;&nbsp;</p>\n<p class=\"MsoNormal\"><strong>Thursday, December 24th: <a href=\"http://www.rustylemmon.com/\">Rusty Lemmon</a> poolside at the Marker</strong></p>\n<p class=\"MsoNormal\">&nbsp;</p>\n<p class=\"MsoNormal\">Catch local favorite, Rusty Lemmon, poolside at The Marker singing island classics and holiday tunes. Groove along with a holiday cocktail in hand while dipping your feet in the pool. It&rsquo;s sure to be one of the most relaxing ways to unwind on Christmas Eve.&nbsp;</p>\n<p class=\"MsoNormal\"><strong>Thursday, December 31st: &nbsp;New Year&rsquo;s Eve</strong></p>\n<p class=\"MsoNormal\">Spend New Years Eve on the rooftop of Sloppy Joe&rsquo;s for the 23rd annual Conch Shell Drop!&nbsp; Or, join the crowds in front of Bourbon Street Pub for the annual Shoe Drop. Watch as the world famous Drag Queen Sushi is lowered into what else, a red shoe, at the stroke of midnight. Wherever you spend your New Year&rsquo;s Eve in Key West, you are bound to see that the people of The Keys know how to unforgettably usher in the New Year. &nbsp;</p>\n<p class=\"MsoNormal\">&nbsp;</p>\n<p>&nbsp;</p>","blogimage_id":"9444","_delete_blogimage":"0","definition":""}