{"definition_id":"56092a983a97703d1e000001","title":"It&rsquo;s a Six-Pack Celebration at Key West Brewfest!","blogimage_id":"9012","_delete_blogimage":"0","url_friendly_name":"its-a-six-pack-celebration-at-key-west-brewfest","date":"2015-08-12T00:00:00Z","categories":"Key West Events","tags":["Key West Events"],"Posted_by":"Rozsa Dimando","short_description":"Mark your calendars and get a room at The Marker Waterfront Resort (while they last!) for the 6th …","more_content":"<div class=\"entry-content\">\n  <p>Mark your calendars and get a room at The Marker Waterfront Resort (while they last!) for the 6<sup>th</sup> annual brew-infused Labor Day festivities in Key West, September 2-7<sup>th</sup>.&nbsp; Back by popular demand, Key West Brewfest will be the highlight of an extended Labor Day celebration down here in the Conch Republic.&nbsp; You heard it right!&nbsp; At The Marker, we&rsquo;re celebrating Labor Day from Wednesday through Monday and you don&rsquo;t want to miss out!</p>\n   <p>As they say…&ldquo;Go Big or Go Home!&rdquo;</p>\n   <p>Fans of artisanal beers and ales can sample more than 150 varieties at dozens of scheduled events all around Key West including beer brunches, brew-pairing dinners, beer and cigar get-togethers, pool parties, a quasi-athletic beer run with &ldquo;beer-stops&rdquo; along the way, (Drink beer, run, drink more beer. It&rsquo;s that simple!), a Signature Tasting Festival on the beach and even a Monday night beer bingo bash. It&rsquo;s a beer-lover&rsquo;s bonanza!</p>\n   <p>Strategically located just three blocks from Duval Street and right next to the new Waterfront Brewery where many of the principal events will be held, The Marker is at the epicenter of all the festivities including the Kick-off Party starting at 5pm on Wednesday, Sept. 2<sup>nd</sup>.&nbsp; On Thursday, Sept. 3<sup>rd</sup>, The Marker will feature live music poolside with Rusty Lemmon from 4-7pm.&nbsp; Friday afternoon from 2-6pm, we&rsquo;ll host a Beer Blast Pool Party sponsored by New Belgium Brewery, complete with free giveaways, drink specials and music provided by DJ Aaron.&nbsp; Saturday, DJ Aaron will be spinning poolside from 1-4pm.&nbsp; Sunday night, you might want to reserve a table for the oceanfront Sam Adams Beer Dinner at our sister property, Southernmost Beach Resort, featuring eight tapas-style courses to be enjoyed with your toes in the sand.</p>\n   <p>Key West Brewfest is sponsored by Southernmost Beach Resort and the Key West Sunrise Rotary Club of the Conch Republic.&nbsp; Proceeds benefit the Rotary Club&rsquo;s charitable initiatives. For a complete schedule of events and tickets, visit: <a href=\"http://www.keywestbrewfest.com/\">www.keywestbrewfest.com</a>.&nbsp; (Consider yourself warned: This suds-filled soiree sells out soon!)</p>\n  <p>For information and reservations at The Marker Waterfront Resort, 200 William Street, Key West, Florida 33040, visit, <a href=\"http://www.themarkerkeywest.com/\">www.themarkerkeywest.com</a> or call (844) 229-8312. (See above warning!)</p>\n</div>","definition":"","blogimage":{"url":"/assets/images/9012/original/brewfest.jpg"}}