{"definition_id":"56092a983a97703d1e000001","title":"The Marker Weddings","blogimage":{"url":"/assets/images/9526/original/markerwedding.jpg"},"url_friendly_name":"the-marker-weddings","date":"2016-01-06T00:00:00Z","categories":"","tags":[],"Posted_by":"Author","short_description":"Romantic getaways in Key West are always in season, but with the arrival of this particular season come a flood of engagements.","more_content":"<p class=\"BodyA\" style=\"line-height:16.0pt;mso-pagination:none\">Romantic\ngetaways in Key West are\nalways in season, but with the arrival of this particular season come a flood of engagements. Now that the question has\nbeen popped the next step is planning your big day, and what better place than <a href=\"http://www.themarkerkeywest.com/weddings\">Key\nWest\nfor that picture-perfect destination\nwedding</a>?</p><p class=\"BodyA\" style=\"line-height:16.0pt;mso-pagination:none\">The Marker Resort offers an array of luxury options for intimate\nweddings with fewer than 20 guests, to ensure your wedding will be as perfect\nas a Key West sunset. At <a href=\"http://www.themarkerkeywest.com/home\">The\nMarker Resort</a> we\noffer premiere lodging options ranging from our <a href=\"http://www.themarkerkeywest.com/the-marker-classic-rooms\">Marker Classic Rooms</a>, and <a href=\"http://www.themarkerkeywest.com/pool-garden-rooms\">Pool Garden Rooms</a>, to our <a href=\"http://\" class=\"\">Key West Harbor Rooms</a>. These perfect accommodations are ideal for a\nmother-of-the-bride and extended family and friends.&nbsp;For the happy couple,\nwe recommend pulling out all the stops and booking the <a href=\"http://www.themarkerkeywest.com/the-captains-quarters\" class=\"\">Captain Quarters</a>! This exquisite room\noffers everything from pampering amenities like signature robes, Key\nWest Aloe bath products and a spacious soaker tub, to celebratory must-haves,\nlike a curated in-room minibar.&nbsp;</p><p class=\"BodyA\" style=\"line-height:16.0pt;mso-pagination:none\">As soon as you arrive in Key West for the big day, <a href=\"http://www.themarkerkeywest.com/home\">The\nMarker Resort</a>\nwill take it from there, leaving you to sit back and sip a cocktail,\nstress-free. The rehearsal dinner is sure to impress against the beautiful\nbackdrop of our serenity pool and vibrant tropical landscaping.</p><p class=\"BodyA\" style=\"line-height:16.0pt;mso-pagination:none\">What&rsquo;s a wedding without a toast? Cocktail hour will follow your\nceremony and be held on <a href=\"http://www.themarkerkeywest.com/home\" class=\"\">The\nMarker&rsquo;s</a> veranda porch. Guests will mingle and sip signature wedding margaritas, mojitos, and rum\npunch while sampling Ahi tuna poke, Key West pink shrimp dipped in a sweet\nchili sauce, or oyster Bloody Mary shooters. You could also choose some of our\nhot hors d&rsquo;oeuvres options ranging from conch fritters with\nkey lime mustard and tenderloin sugarcane lollipops to coconut shrimp with\npineapple dipping sauce. With all these tasty options, it&rsquo;s easy to see that\nthe tantalizing flavors of Key West play a big role in our menu!&nbsp;</p><p class=\"BodyA\" style=\"line-height: 16pt;\">Post\ncocktail hour the wedding party will be lead into our newly built Harbor House, set aglow with\ntwinkling candles atop every table. Dinner features two entrees of your choice\nfrom our extensive list of offerings. Some Marker favorites include chicken\nstuffed with&nbsp;prosciutto,\ngoat cheese, spinach, and roasted red pepper or seared scallops in a key lime\nbeurre blanc. The couple may prefer to choose from our station dinner or buffet\noption, but enough about dinner- what&rsquo;s a wedding without cake? You&rsquo;ll have a\ntasty choice between The Marker Resort&rsquo;s signature wedding cake, or other delicious\ndessert options.</p><p class=\"BodyA\" style=\"line-height: 16pt;\"> After\nthe wedding, we hope that newlyweds will stay and enjoy all that Key West has\nto offer. We suggest setting sail to the <a href=\"https://www.drytortugas.com/\">Dry Tortugas</a>, or a visit <a href=\"http://www.hemingwayhome.com/\">the Ernest\nHemmingway home</a>. We&rsquo;ll call it a pre-honeymoon honeymoon, but keep\nin mind that <a href=\"http://\">Key\nWest honeymoons</a> are some of the best around. Once you&rsquo;ve experienced\na wedding at The Marker Resort, you&rsquo;ll understand why people can&rsquo;t help but\nfeel the <a href=\"http://www.themarkerkeywest.com/romance\" class=\"\">love in Key West</a>!\nSpeaking of feeling the love, we want to offer our newly-engaged readers\nsomething very special: <b>If you book your 2016 wedding at The Marker\nResort before January 31, 2016, you&rsquo;ll receive 16% off your food and beverage! Be\nsure to mention our blog post to receive this special offer</b>. Just another great reason to celebrate your big\nday with us.</p><p class=\"BodyA\" style=\"line-height: 16pt;\"> </p>","blogimage_id":"9526","_delete_blogimage":"0","definition":""}