["{\n\t\"_template\": \"html\",\n\t\"content\": \"<h1>Rich Art Heritage</h1>\\n<div>&nbsp;</div>\\n<div>Key West has a deep-rooted legacy of art and culture. From Ernest Hemingway to Tennessee Williams, some of America&rsquo;s most significant authors, playwrights and artists have lived here, worked here, or been famously inspired by the island&rsquo;s natural wonder. And today, Key West remains home to a vibrant community of contemporary artists who ensure that our storied arts and literary history will continue to thrive and evolve.</div>\\n<div>&nbsp;</div>\\n<div>\\n<h3><strong>Architecture</strong></h3>\\n<p style=\\\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-family: Arial, sans-serif; font-size: 15px; font-stretch: inherit; line-height: 25px; vertical-align: baseline; overflow: visible;\\\">Conch architecture is the signature style that was born in Key West, and can be found throughout the island. Visitors will immediately recognize the iconic appearance of conch homes that grace postcards: wood and clapboard houses elevated from the ground on posts or piers, many with shingled roofs, low gables, and double-hung sash windows. The style was initially developed in the 18th century by Bahamian immigrants, and has always made perfect sense for Key West&rsquo;s tropical climate: for instance, raised homes allow for air to circulate under the floor. Today the conch style captures the charming island spirit of the Florida Keys.</p>\\n<p style=\\\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-family: Arial, sans-serif; font-size: 15px; font-stretch: inherit; line-height: 25px; vertical-align: baseline; overflow: visible;\\\">Other stately architectural styles flourish in Key West too. Visit the Old Town neighborhood to explore an array of mansions, churches, and civic buildings in the Classical Revival, Queen Anne, and American Foursquare styles, among others.</p>\\n<h3><strong>Arts</strong></h3>\\n<p style=\\\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-family: Arial, sans-serif; font-size: 15px; font-stretch: inherit; line-height: 25px; vertical-align: baseline; overflow: visible;\\\">Key West&rsquo;s creative tapestry has been woven over the years by an array of world-class writers and visual artists. Most famously, it was here that literary &ldquo;Papa&rdquo; Ernest Hemingway and iconic American playwright Tennessee Williams lived and worked. A museum and theater bearing their respective names continue to honor the legacy of these famous former residents.</p>\\n<p style=\\\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-family: Arial, sans-serif; font-size: 15px; font-stretch: inherit; line-height: 25px; vertical-align: baseline; overflow: visible;\\\">Key West&rsquo;s creative community continues to thrive. Vibrant and varied, the island&rsquo;s artists build upon a storied heritage to create one of the country&rsquo;s finest destinations for cultural tourism. Art galleries abound, live theater and dance light up stages, literary events attract international attention, and museums highlight both the natural beauty of the Florida Keys and the artistic accomplishments of local residents and global talent. Together, this creative culture has built a diverse and lively Key West community that waits to welcome you!</p>\\n</div>\\n<div>&nbsp;</div>\\n<p>&nbsp;</p>\",\n\t\"rendered_height\": 500\n}",{"_template":"html","rendered_height":500,"content":"<p>testing</p>"}]