[{"_template":"html","content":"\n\t\t\t\t\t\t<h1>Site Security Statement</h1><div><h2>For The Marker Resort Website</h2><div><p style=\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-stretch: inherit; font-size: 15px; line-height: 25px; font-family: Arial, sans-serif; vertical-align: baseline; overflow: visible;\">We want our website –&nbsp;<a href=\"http://www.themarkerkeywest.com\" class=\"\" hreflang=\"\">www.themarkerkeywest.com</a>&nbsp;(hereinafter identified as the \"Site\") – visitors to feel confident about using our Site to plan and purchase their accommodations, so we are committed to protecting the information we collect. All personal information you provide is encrypted and secure.</p><h3>Secure Reservations</h3><p style=\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-stretch: inherit; font-size: 15px; line-height: 25px; font-family: Arial, sans-serif; vertical-align: baseline; overflow: visible;\">If you decide to make an online reservation at the Site, you will be linked to a reservation interface and a third party booking engine (“Booking Engine”) provided by SynXis. While it appears to be part of our site, the Booking Engine is in fact provided by a third party and is governed by its privacy practices. We understand that security remains the primary concern of online consumers and have chosen the Booking Engine Vendor carefully.</p><h3>Protecting Your Information</h3><p style=\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-stretch: inherit; font-size: 15px; line-height: 25px; font-family: Arial, sans-serif; vertical-align: baseline; overflow: visible;\">We would like our Site visitors to feel confident about using the Site to plan and purchase their accommodations, so Hotel is committed to protecting the information we collect. Hotel has implemented a security program with its web design and maintenance firm to keep information that is stored in our systems protected from unauthorized access.</p><p style=\"margin-bottom: 25px; padding: 0px; border: 0px; outline: none; font-stretch: inherit; font-size: 15px; line-height: 25px; font-family: Arial, sans-serif; vertical-align: baseline; overflow: visible;\">Our Site is hosted in a secure environment. The Site servers/systems are configured with data encryption, or scrambling, technologies, and industry-standard firewalls. When you enter personal information during the reservation process, or during a customer email sign-up, your data is protected by Secure Socket Layer (SSL) technology to ensure safe transmission.</p></div></div>\n\t\t\t\t\t"}]